<?php

// //适用于近距离
// function  GetShortDistance($lon1, $lat1, $lon2, $lat2)
// {

// 	$DEF_PI = 3.14159265359; // PI
// 	$DEF_2PI= 6.28318530712; // 2*PI
// 	$DEF_PI180= 0.01745329252; // PI/180.0
// 	$DEF_R =6370693.5; // radius of earth
// 	// 角度转换为弧度
// 	$ew1 = $lon1 * $DEF_PI180;
// 	$ns1 = $lat1 * $DEF_PI180;
// 	$ew2 = $lon2 * $DEF_PI180;
// 	$ns2 = $lat2 * $DEF_PI180;
// 	// 经度差
// 	$dew = $ew1 - $ew2;
// 	echo $dew."aa".$DEF_PI."aa";
// 	// 若跨东经和西经180 度，进行调整
// 	$dx = $DEF_R * cos($ns1) * $dew; // 东西方向长度(在纬度圈上的投影长度)
// 	$dy = $DEF_R * ($ns1 - $ns2); // 南北方向长度(在经度圈上的投影长度)
// 	// 勾股定理求斜边长
// 	$distance = sqrt($dx * $dx + $dy * $dy);
// 	echo  $distance;
// }
// GetShortDistance(121.221917,30.890035,121.342706,30.762205);die();

// select left（longlat, 115)

// 121.330145,30.755877
// 121.338769,30.808992

ini_set('display_errors',  true);
require_once(dirname(__FILE__) . '/app.php');
error_reporting(E_ALL);

die('+OK');


// $DEF_PI = 3.14159265359; // PI
// $DEF_2PI= 6.28318530712; // 2*PI
// $DEF_PI180= 0.01745329252; // PI/180.0
// $DEF_R =6370693.5; // radius of earth
// // 角度转换为弧度
// $ew1 = $lon1 * 0.01745329252;
// $ns1 = $lat1 * 0.01745329252;
// $ew2 = $lon2 * 0.01745329252;
// $ns2 = $lat2 * 0.01745329252;
// // 经
// $dew = $lon1 * 0.01745329252 - $lon2 * 0.01745329252;
// echo $dew."aa".$DEF_PI."aa";
// // 若跨东经和西经180 度，进行调整
// $dx = 6370693.5 * cos($lat1 * 0.01745329252) * ($lon1 * 0.01745329252 - $lon2 * 0.01745329252); // 东西方向长度(在纬度圈上的投影长度)
// $dy = 6370693.5 * ($lat1 * 0.01745329252 - $lat2 * 0.01745329252); // 南北方向长度(在经度圈上的投影长度)
// // 勾股定理求斜边长
// $distance = sqrt(POW((6370693.5 * cos($lat1 * 0.01745329252) * ($lon1 * 0.01745329252 - $lon2 * 0.01745329252)),2) + POW((6370693.5 * ($lat1 * 0.01745329252 - $lat2 * 0.01745329252)),2));